In [3]:
import pandas as pd
import numpy as np

In [4]:
datetime_list = np.array(['03-04-2005 10:35:01 pM',
                         '23-05-2010 12:33:01 PM',
                         '04-09-2009 09:10:01 AM','05-09-2009 09:10:01 AM'])
date_stamp_list =pd.to_datetime(datetime_list,format='%d-%m-%Y %I:%M:%S %p',yearfirst=True)# [pd.to_datetime(date,format='%d-%m-%Y %I:%M %p') for date in datetime_list]

In [5]:
date_stamp_list

DatetimeIndex(['2005-04-03 22:35:01', '2010-05-23 12:33:01',
               '2009-09-04 09:10:01', '2009-09-05 09:10:01'],
              dtype='datetime64[ns]', freq=None)

In [7]:
# 使用布尔语句选取部分数据或loc行索引选取数据

data_list = [[11,22,33],[22,33,44],[33,44,55],[44,55,66]]
# 时间序列数据
timesequence=pd.DataFrame(data=data_list,index=date_stamp_list,columns=['一','二','三'])

[print(timesequence.loc[index]) for index in date_stamp_list]

一    11
二    22
三    33
Name: 2005-04-03 22:35:01, dtype: int64
一    22
二    33
三    44
Name: 2010-05-23 12:33:01, dtype: int64
一    33
二    44
三    55
Name: 2009-09-04 09:10:01, dtype: int64
一    44
二    55
三    66
Name: 2009-09-05 09:10:01, dtype: int64

[None, None, None, None]

In [16]:
# 将日期数据拆解为多个部分

# 使用pandas中Series对象的属性dt
timesequence['data']=date_stamp_list
timesequence['year'] = timesequence['data'].dt.year
timesequence['month'] = timesequence['data'].dt.month
timesequence['day'] = timesequence['data'].dt.day
timesequence['hour'] = timesequence['data'].dt.hour
timesequence['minute'] = timesequence['data'].dt.minute
timesequence['second'] = timesequence['data'].dt.second
timesequence

,一,二,三,data,year,month,day,hour,min,minute,sec
2005-04-03 22:35:01,11,22,33,2005-04-03 22:35:01,2005,4,3,22,35,35,1
2010-05-23 12:33:01,22,33,44,2010-05-23 12:33:01,2010,5,23,12,33,33,1
2009-09-04 09:10:01,33,44,55,2009-09-04 09:10:01,2009,9,4,9,10,10,1
2009-09-05 09:10:01,44,55,66,2009-09-05 09:10:01,2009,9,5,9,10,10,1

In [19]:
import pandas as pd
# 对星期进行编码，星期一为0，星期日为6
dates = pd.Series(pd.date_range("11/09/2002",periods = 3,freq = "ME"))
timesequence['data'].dt.weekday

2005-04-03 22:35:01    6
2010-05-23 12:33:01    6
2009-09-04 09:10:01    4
2009-09-05 09:10:01    5
Name: data, dtype: int32

In [21]:
# 计算两个日期之间的时间差，直接使用'-'运算符即可计算
timedelta = timesequence['data'].iloc[1] - timesequence['data'].iloc[0]
timedelta

Timedelta('1875 days 13:58:00')

In [28]:
# 创建滞后时间序列数据(时间序列移动)，使用DataFrame中的shift()函数

# 只对某一列进行序列移动
timesequence['year'].shift(periods = 1,fill_value=0)
# 对全体数据进行移动
timesequence.shift(periods = 2)

,一,二,三,data,year,month,day,hour,min,minute,sec
2005-04-03 22:35:01,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2010-05-23 12:33:01,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-09-04 09:10:01,11.0,22.0,33.0,2005-04-03 22:35:01,2005.0,4.0,3.0,22.0,35.0,35.0,1.0
2009-09-05 09:10:01,22.0,33.0,44.0,2010-05-23 12:33:01,2010.0,5.0,23.0,12.0,33.0,33.0,1.0

In [45]:
# 处理时间序列中的缺失值

sequence = timesequence.drop('data',axis = 1)
sequence = sequence.shift(2)
# 向前填充bfill()，向后填充ffill()
# sequence.bfill()

# 使用插值法进行填充
sequence.interpolate(method='slinear')

,一,二,三,year,month,day,hour,min,minute,sec
2005-04-03 22:35:01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2010-05-23 12:33:01,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2009-09-04 09:10:01,11.0,22.0,33.0,2005.0,4.0,3.0,22.0,35.0,35.0,1.0
2009-09-05 09:10:01,22.0,33.0,44.0,2010.0,5.0,23.0,12.0,33.0,33.0,1.0